In [1]:
import pandas as pd
import numpy as np

In [3]:
ser1 = pd.Series([np.nan, 2, np.nan,4,5,6,np.nan,np.nan])

In [4]:
ser1

0    NaN
1    2.0
2    NaN
3    4.0
4    5.0
5    6.0
6    NaN
7    NaN
dtype: float64

In [9]:
ser2 = pd.Series(np.arange(len(ser1)))

In [10]:
ser2

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int64

In [11]:
np.where(pd.isnull(ser1), ser2, ser1)

array([0., 2., 2., 4., 5., 6., 6., 7.])

In [12]:
ser1.combine_first(ser2)

0    0.0
1    2.0
2    2.0
3    4.0
4    5.0
5    6.0
6    6.0
7    7.0
dtype: float64

In [14]:
df1 = pd.DataFrame({'X':[1,np.nan,3,5],
                   'Y':[7,np.nan, 9,np.nan],
                   'Z':[np.nan, 11,13,15]})

In [15]:
df2 = pd.DataFrame({'X':[2, 4, np.nan, 6],
                   'Y':[np.nan, 8, 10,np.nan]})

In [16]:
df1

     X    Y     Z
0  1.0  7.0   NaN
1  NaN  NaN  11.0
2  3.0  9.0  13.0
3  5.0  NaN  15.0

In [17]:
df2

     X     Y
0  2.0   NaN
1  4.0   8.0
2  NaN  10.0
3  6.0   NaN

In [18]:
df1.combine_first(df2)

     X    Y     Z
0  1.0  7.0   NaN
1  4.0  8.0  11.0
2  3.0  9.0  13.0
3  5.0  NaN  15.0